""" print("Введите чимло чтобы узнать является ли оно простым (2<=n<=10^9)")
i = 1
while(i):
    n = int(input())
    if (2 <= n <= 1000000000):
        if ((n % 2 != 0 and n % 3 != 0 and n % 5 != 0 and n % 7 != 0) or n == 2 or n == 3 or n == 5 or n == 7):
            print("Число", n , "простое")
        else:
            print("Число", n , "составное")
    else: 
        print("Неправильный ввод")
    i = int(input("Для продолжения введите 1\nЧтобы выйти введите 0\n")) """


k =10
i =0
while k:
    i+=1
    print(0)
    k-=1
print(i)