
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	for (int i = 0; i < 1000; i++) {
		i++;
		cout << "Введите коэффицент a\n";
		double a;
		cin >> a;
		cout << "Введите коэффицент b\n";
		double b;
		cin >> b;
		cout << "Введите коэффицент c\n";
		double c;
		cin >> c;
		if (a == 0) {
			if (b == 0) {
				if (c == 0) {
					cout << "x - любое действительное число.";
				}
				else {
					cout << "Уравнение не имеет смысла.";
				}
			}
			else
				if (c == 0) {
					cout << "x = 0";
				}
				else {
					cout << "x = " << -c / b;
				}
		}
		else {
			if (b == 0) {
				if (c == 0) {
					cout << "x = 0";
				}
				else {
					if ((a < 0 && c > 0) || (a > 0 && c < 0)) {
						cout << "x1 = " << sqrt(-c / a) << "\nx2 = " << -sqrt(-c / a);
					}
					else {
						cout << "Нет действительных корней";
					}
				}
			}
			else {
				if (c == 0) {
					cout << "x1 = 0\nx2 = " << -b / a;
				}
				else {
					if (b * b - 4 * a * c > 0) {
						cout << "x1 = " << (-b + sqrt(b * b - 4 * a * c)) / 2 * a << "\nx2 = " << (-b - sqrt(b * b - 4 * a * c)) / 2 * a;
					}
					else {
						if (b * b - 4 * a * c == 0) {
							cout << "x = " << -b / 2 * a;
						}
						else {
							cout << "Нет действительных корней";
						}
					}
				}
			}
		}
		system("pause");
	}
}

/*
* Для проверки(a,b,c):
* 0 0 0    уравнение вида 0 = 0
* 0 0 3    уравнение вида 3 = 0
* 0 -5 0   уравнение вида -5x = 0
* 0 5 -4   уравнение вида -5x - 4 = 0
* 6 0 0    уравнение вида 6x^2 = 0
* -5 0 1   уравнение вида -5x^2 + 1 = 0
* 1 0 3    уравнение вида x^2 + 3 = 0
* -6 5 0   уравнение вида -6x^2 + 5x = 0
* 2 9 4    уравнение вида 2x^2 + 9x + 4 = 0  D > 0
* 1 4 4    уравнение вида x^2 + 4x + 4 = 0   D = 0
* 2 3 3    уравнение вида 2x^2 + 3x + 3 = 0  D < 0
*/